[
  {
    "name": "Dr. Teresa Vasquez",
    "avatar": "https://secure.gravatar.com/avatar/44878da8d18e9ec0796935198ed5c32a?s=500",
    "bio": "Dr. Teresa Vasquez (Dr. T) was born to an immigrant from Guatemala, and a Creole woman from Louisiana. Her father always said that he “wanted a football player, but what he got instead was the best blessing in the world…a daughter.” (even though Dr. T also played women’s professional football, so he got both!) Her mother died when she was five, leaving her father to raise three young children.\r\n\r\nHer dad ignited her passion for problem solving as a child, working together when he could, on electrical and mechanical engineering projects. She credits this as the beginnings of her passion for technology and software engineering.\r\n\r\nShe holds a master’s in business administration and a doctorate of education with emphasis in assistive technology and adult education.\r\n\r\nShe is active in the tech community in Nashville, TN and serves on various boards that promote diversity in tech for neurodivergent and Black software engineers.\r\n\r\nCurrently she leads the Evening Web Development program at Nashville Software School and is a professor at Trevecca Nazarene University.\r\n\r\nSocial Media\r\nhttps://drteresavasquez.com \r\nhttps://www.linkedin.com/in/drteresavasquez/\r\nhttps://twitter.com/DrTeresaVasquez\r\nhttps://instagram.com/drteresavasquez \r\n\r\n",
    "url": "https://reppedintech.com",
    "organization": "Autism Possible, Repped in Tech",
    "title": "Code Snacks with Repped in Tech",
    "abstract": "The intersection of diversity and tech lies in what we have in common. Food brings people together and allows those who are apprehensive about their tech experience a seat at the table for a unified experience of food, learning and fun because we all love to eat!",
    "description": "\"Building Your Brand and Community by Merging Your Passions with Tech\"\r\n\r\nTechnology has become an integral part of our daily lives, and it has opened up new opportunities for personal and professional growth. With the rise of social media and online communities, it is now easier than ever to build a brand and connect with like-minded individuals who share your interests and passions.\r\n\r\nIn this presentation, we will explore how to merge your passions with the tech that you are most passionate about to build your brand and grow your community. We will discuss the benefits of sharing your authentic self and how it can help you reach your goals.\r\n\r\nTopics to be covered and modeled:\r\n- The benefits of merging your passions with technology\r\n- How to identify and define your personal brand\r\n- Tips for using social media to build your online presence\r\n- Strategies for creating content that resonates with your audience\r\n- Building an online community through engagement and collaboration\r\n- The importance of authenticity and staying true to your passions\r\n\r\nAudience:\r\nThis presentation is perfect for individuals who are looking to build their personal or professional brand and connect with like-minded individuals in tech. Whether you are a seasoned technologists or just starting out, this presentation will provide you with practical tips and strategies for leveraging technology to achieve your goals.\r\n\r\nIf you are interested in learning how to leverage technology to build your brand and grow your community, this presentation is for you. Join us for an interactive and informative session that will provide you with the tools and strategies you need to succeed and help us build a more diverse tech landscape.",
    "twitter": "@youcancallmedrt"
  },
  {
    "name": "Valarie Regas",
    "avatar": "https://papercallio-production.s3.amazonaws.com/uploads/user/avatar/23633/DSC_6245.jpg",
    "bio": "Valarie Regas is a DevOps enthusiast, a Georgia Tech coding bootcamp graduate, and a veteran mommy. She holds a BA in Psychology and currently works as a Developer Advocate. After years being a stay-at-home mom, she decided to change her life by entering Tech, and has learned a lot along the way. She enjoys mixed martial arts fighting, table-top role playing games, public speaking, creating tiny humans, and political activism.  ",
    "url": "http://www.valarieregas.com",
    "organization": "StarTree",
    "title": "The Product Doesn't Develop Itself: A Business Case for Taking Care of Engineers",
    "abstract": "In our industry, there is pressure to deliver high quality, tested, innovative software. We focus on deadlines and metrics to ensure quality. But what of the people doing the work? Join me to learn how, as a manager, you can support your resources to deliver their best work... not just the minimum.",
    "description": "This talk would work really well as a keynote/ending session, as it has many calls to action for personal growth, and especially asks leadership/management to think deeply about their priorities and methods of work. This is not a \"feel good\" session; it is about the financial impact of engineers being burnt out, depressed, anxious, or suffering from substance use disorders. This talk will give leaders concrete ways to support IC's, so that they can perform optimally and consistently. Also, I will share ways in which IC's can pinpoint their needs, and advocate to have them met/accommodated by leadership.",
    "twitter": "@ValarieRegas"
  },
  {
    "name": "Ejiro Asiuwhu",
    "avatar": "https://secure.gravatar.com/avatar/f1a4b1000507a0e5f1133a43200f107e?s=500",
    "bio": "Product-driven software engineer and co-founder at Veet [joinveet.com]",
    "url": "https://www.linkedin.com/in/ejiro-asiuwhu",
    "organization": "Arceptive",
    "title": "End-to-end type safety with Nuxt 3",
    "abstract": "Create type-safe full-stack apps with Nuxt 3 while prioritizing developer experience. Ensure type soundness and avoid runtime errors. With Nuxt 3's ecosystem, build scalable and robust applications easily. Elevate your development skills and create reliable apps",
    "description": "Are you tired of runtime errors and the hassle of debugging? Join me to learn how to create type-safe full-stack apps with Nuxt 3 using TypeScript. With Nuxt's powerful ecosystem, including its integration with Prisma for database access, you can build scalable and reliable applications without compromising on developer experience. Don't miss out on this opportunity to learn how to ensure type soundness throughout your app and create robust applications. Join me to take your development skills to the next level.\r\n\r\n\r\n\r\n",
    "twitter": "@ejirocodes"
  },
  {
    "name": "Erik Hanchett",
    "avatar": "https://secure.gravatar.com/avatar/3f7eb597d8c250aa30edd5de160c1898?s=500",
    "bio": "My name is Erik Hanchett and I'm a software developer from Reno, NV. When I'm not teaching people how to code on my YouTube channel, you'll find me with my family on the slopes of Lake Tahoe.",
    "url": "http://erik.video",
    "organization": "AWS",
    "title": "Using Cloud Services For Front-End Developers",
    "abstract": "Cloud providers like AWS offers a lot of services. Cognito, S3, Hosting, and Lambda functions to name a few. As a front-end developer what services should I learn? Do I need to learn devops, and IAM rules? How do I provision the backend?",
    "description": "Cloud providers like AWS offers a lot of services. Cognito, S3, Hosting, and Lambda functions to name a few. As a front-end developer what services should I learn? Do I need to learn devops, and IAM rules? How do I provision the backend? \r\n\r\nIn this talk I'll discuss some core services and tooling, like AWS Amplify, AppSync and Lambda and best practices and approaches to using them. We'll look at terraform, SST, and other providers that can provision your backend in minutes. \r\n",
    "twitter": "@ErikCH"
  },
  {
    "name": "Bryce Embry",
    "avatar": "https://secure.gravatar.com/avatar/550c9364e8fcd343a307864b56ff8332?s=500",
    "bio": "Bryce is a manager and programmer who leads multiple software development teams at Vanderbilt University Medical Center.  He is passionate about improving code quality and building strong team relationships.",
    "url": "http://www.bryceembry.com",
    "organization": "Vanderbilt University Medical Center",
    "title": "How to lead brilliant developers",
    "abstract": "From Thomas Edison to Steve Jobs, working with the best minds of your age isn't always easy.  The mind set that makes them great always has a down-side.  As a leader, how do you counter-balance the negative side-effects of brilliance to help your team shine brighter?",
    "description": "Sometimes the most talented people can also be the most frustrating to work with.  They may obsess over minor details, insist on rigid adherence to peculiar rules, or simply not play well with others. So, how do you lead someone who is brilliant but frustrating?  In this session you’ll learn how some smart people see the world differently, understand the mind-sets which not only make them great but also give them grief, and discover how much they need your leadership.  You’ll leave with practical plans to reduce frustration and help the brilliant people on your team shine even brighter.  ",
    "twitter": ""
  },
  {
    "name": "Taylor Wilder",
    "avatar": "https://secure.gravatar.com/avatar/d41957f0512f29927f5da87c8d3d236c?s=500",
    "bio": "Taylor Wilder is a nonprofit professional in Nashville, TN. She is passionate about capacity building for local nonprofits to maximize their impact in her community.",
    "url": "https://www.hon.org/",
    "organization": "Hands On Nashville",
    "title": "Volunteer Your Skills with GeekCause",
    "abstract": "At Hands On Nashville, we often see that nonprofits \"don't know what they don't know\" about the possibilities with technology. GeekCause Volunteers have the expertise to guide nonprofits to impactful solutions that will ultimately allow a nonprofit to serve their community at a higher level.",
    "description": "Hands On Nashville is a local nonprofit that aims to meet community needs through volunteerism. GeekCause, a program of Hands On Nashville, is designed to match skilled tech volunteers with nonprofits seeking technological guidance. By sharing your tech expertise and a bit of your time, you can build capacity for local organizations working hard to meet the most pressing needs in our community. Most GeekCause projects are completed collaboratively and on a flexible schedule by individuals or small teams working remotely.\r\n\r\nKey takeaways:\r\n-Nonprofits often lag behind in the tech space, which creates administrative barriers to maximizing their impact on the community. GeekCause volunteers provide invaluable service to nonprofits by providing guidance on security, automation, accessibility, etc.\r\n-Volunteering time with GeekCause gives volunteers a space to flex their skills outside of their day-to-day, to network, and to impact their community.",
    "twitter": ""
  },
  {
    "name": "Wes Braga",
    "avatar": "https://pbs.twimg.com/profile_images/1564986614941622273/ZWeUJ9nG_400x400.jpg",
    "bio": "Hi y'all! I'm Wes, and I'm a software engineer and guitar shredder turned JavaScript developer. Whether I'm writing complex code or playing a guitar solo, I approach both with a creative mindset. My specialty lies in web development, and I love exploring new ways to optimize code and create dynamic web applications.\r\n\r\nWhen I'm not programming, you can find me playing video games with my lovely wife and hanging with my 2 little boys out in the yard, sometimes practicing guitar, attending live shows, or exploring new music.",
    "url": "https://wesbraga.com",
    "organization": "Bambee",
    "title": "Supercharge Your React App: Migrating from CRA to Vite",
    "abstract": "Want to speed up your front-end development and improve performance, regardless of the framework you use? Migrate to Vite! It streamlines code and boosts productivity with fast builds and a user-friendly environment.",
    "description": "# Supercharge Your React App: Migrating from CRA to Vite\r\n\r\nHey everyone! Today, we are going to talk about one of the most exciting topics in the world of software development – migrating from create-react-app to Vite!\r\n\r\n## Reasons\r\n\r\nLet's start by talking about create-react-app. Don't get me wrong, it was a great tool when we're all struggling with Webpack. It has helped countless developers get started with React quickly and easily. \r\n\r\nBut it's not perfect, and sometimes we need something more powerful and flexible.\r\n\r\n- You have to eject in order to go the extra mile for example using postcss or altering anything related to the webpack setup\r\n\r\n- No longer actively maintained\r\n\t- See => https://github.com/facebook/create-react-app/issues/11180\r\n\r\n## Vite for the win\r\n\r\nThat's where Vite comes in. It's fast, lightweight, and has some amazing features that can make your life as a React developer a lot easier. And the best part? It's pronounced \"veet\". Not \"vite\" like the French word for \"fast,\" but \"veet\" as if it were short for \"very neat.\"\r\n\r\nNow, you might be wondering, \"why do I need to migrate to Vite? I already have create-react-app!\" The answer is simple – Vite's HMR and build times are faster and better. \r\n\r\nImagine saving seconds of every developer in your team multiple times a day through out the year. Given what the average React dev makes in this space that benefit equals to a compound monetary savings to your company or project. \r\n\r\n[Insert a funny meme related to Vite]\r\n\r\n### But How?\r\n\r\nCreate react app uses webpack under the hood to bundle your JS code and serve it to the browser. The problem with bundling during development is that any change made will cause webpack to transpile and bundle before it can serve the new changes to you.\r\n\r\nVite on the other hand uses the browser's native ES Modules after transpiling the application code, removing the need to bundle code in development and simply serving the new changes.\r\n\r\nTranspilation can be slow too right?\r\nYes, create-react-app by default uses babel, another javascript tool to transform your lovely JSX or TSX code into javascript that the browser understand. \r\n\r\nVite uses Esbuild by default, which is a bundler/transpiler built in Go, a much faster language for performing such tasks.\r\n\r\n[Insert comparison]\r\n\r\nOf course, migrating from create-react-app to Vite can be a daunting task. But fear not, because with some patience, a little bit of time, and a lot of coffee, you can make the switch with ease. And if you get stuck along the way I have this repository template I put together to help you out in this journey.\r\n\r\n[Insert repository with template]\r\n\r\nNow, I'm not here just to talk and show you some funny memes related. I'm here to also get my hands dirty with code and show you how it can be done live\r\n\r\nGo!\r\n\r\n[Start coding live]\r\n1. Installing dependencies\r\n\t- vite\r\n\t- @vitejs/plugin-react\r\n\t- vite-plugin-ejs (optional)\r\n \r\n1. Creating a vite.config.ts file\r\n2. Environment Variables\r\n3. Build time templating\r\n4. Dev and build\r\n\r\n### Alternatives\r\n\r\nIf you are in a situation that you can't migrate that much from CRA, but you want to develop with faster build times I would recommend looking into esbuild-loader with craco which would allow you to continue using CRA but swap the slow transpiler and get some of the benefits that we went through.\r\n\r\n### Pull Request worth taking a look\r\n\r\n- https://github.com/wesbragagt/migrate-cra-vite-app\r\n- https://github.com/excalidraw/excalidraw/pull/6441/files\r\n\r\n### Q/A\r\n",
    "twitter": "@wesbragagt"
  },
  {
    "name": "M. Scott Ford",
    "avatar": "https://secure.gravatar.com/avatar/6505558b78500a305dbbc6c8b2953474?s=500",
    "bio": "M. Scott Ford is the Co-Founder & Chief Code Whisperer (CTO) of Corgibytes, where he has quietly led a software maintenance revolution for the past decade. Where most people find nothing but frustration, shame, and bugs in legacy code, Scott has centered his work around his genuine love of software modernization and helping others use joy, empathy, and technical excellence to make their systems more stable scalable and secure. Scott’s ideas have been featured in books such as The Innovation Delusion and as a guest lecturer at Harvard University. Scott is the author of three courses on LinkedIn Learning: Dealing With Legacy Code And Technical Debt, Code Quality, and Clean Coding Practices. He is the host of the podcast Legacy Code Rocks and enjoys helping other menders find a sense of belonging in a world dominated by makers.",
    "url": "http://corgibytes.com",
    "organization": "Corgibytes",
    "title": "Embracing the Red Bar: A technique for safely refactoring your test suite",
    "abstract": "Have your tests become brittle? Have you strongly considered dumping your test suite and starting over? Don't throw them away. Refactor them. But you need to be careful so that you don't introduce false positives. We'll explore a method of refactoring your tests that makes sure they still work.",
    "description": "## Outline\r\n\r\n* Reasons why your test code should have same high quality you insist on for your production code\r\n* Normal TDD cycle\r\n   * Red, Green, Refactor\r\n   * Designed for production code\r\n   * Ensures that your test only passes as a result of the code that you write\r\n   * Allows you to safely refactor your production code without worrying about introducing failures\r\n* Risks of changing your tests without watching them fail\r\n* Red-bar Cycle\r\n   * Red, Refactor, Green\r\n      * Mutate the production code - produce the red bar (your test is failing)\r\n      * Refactor your test - continue to see the red bar (your test continues to fail)\r\n      * Reverse the mutation - bar should switch to green (your test should now pass)\r\n   * Designed for your test code\r\n   * Ensures that your test code continues to detect the failure condition that it was designed to\r\n* Walk through a live example\r\n\r\n## Learning Outcome\r\n\r\nA technique for safely improving the quality of your test suite without introducing false positives.\r\n\r\n## Target Audience\r\n\r\nDevelopers, Testers\r\n",
    "twitter": "@mscottford"
  }
]
